run/abl/fullScale/fullScaleTurbRefined2/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($flowVelocity 0 0);

boundaryField
{
    frontField
    {
        type            atmBoundaryLayerInletVelocity;
        flowDir         (1 0 0);
        zDir            (0 0 1);
        Uref            $flowVelocity;
        Zref            $refHeight;
        z0              uniform $z0;
        zGround         uniform 0.0;
        value           $internalField;
    }
    backField
    {
        type            zeroGradient;
    }
    sideField
    {
        type            empty;
    }
    top
    {
      type            atmBoundaryLayerInletVelocity;
      flowDir         (1 0 0);
      zDir            (0 0 1);
      Uref            $flowVelocity;
      Zref            $refHeight;
      z0              uniform $z0;
      zGround         uniform 0.0;
      value           $internalField;
    }
    ground
    {
        type            noSlip;
    }
    symPlane
    {
        type            empty;
    }
}
// ************************************************************************* //
